function bonusScore(x){
    bonus = 0;
    if(x <= 100){
        bonus += 5;
    }else if(x <=1000){
        bonus = x * 0.2;
    }else if(x > 1000){
        bonus = x * 0.1;
    }
    if(x % 2 === 0){
        bonus += 1;
    }
    if(x % 10 === 5){
        bonus += 2;
    }
    console.log(bonus);
    console.log(x + bonus);
}

bonusScore(20) 
//6 26 
bonusScore(175) 
//37 212 
bonusScore(2703) 
//270.3 2973.3 
bonusScore(15875) 
//1589.5 17464.5

//до 100 включително, бонус точките са 5.
//по-голямо от 100, бонус точките са 20% от числото.
//по-голямо от 1000, бонус точките са 10% от числото.
//Допълнителни бонус точки (начисляват се отделно от предходните):
//За четно  + 1 т.
//За число на 5  + 2 т.